Reports/Лео_ПлатежныйКалендарь/Лео_ПлатежныйКалендарь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>Лео_ПлатежныйКалендарь</name>
  <attributes>
    <name>ДатаС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Report>

AccumulationRegisters/ЛЕО_ЗаявкиНаРасходованиеСредств/ЛЕО_ЗаявкиНаРасходованиеСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЛЕО_ЗаявкиНаРасходованиеСредств</name>
  <comment>(Упр)</comment>
  <resources>
    <name>СуммаВзаиморасчетов</name>
    <comment>Сумма в валюте взаиморасчетов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаУпр</name>
    <comment>Сумма в валюте упр. учета</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <comment>Сумма к оплате</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>абс_СуммаНДСУпр</name>
    <comment>Сумма НДС в валюте упр. учета</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>абс_СуммаНДС</name>
    <comment>Сумма НДС к оплате</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>абс_СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЗаявкаНаРасходование</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРасходованиеСредств</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сделка</name>
    <type>
      <types>DocumentRef.СчетНаОплатуПоставщика</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.СчетНаОплатуПокупателю</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
      <types>CatalogRef.ВидыРаспределенияПоПроектам</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументРасчетовСКонтрагентом</name>
    <type>
      <types>DocumentRef.ОтчетКомитентуОПродажах</types>
      <types>DocumentRef.ОтражениеПоступленияТоваровИУслугНДС</types>
      <types>DocumentRef.АктОбОказанииПроизводственныхУслуг</types>
      <types>DocumentRef.ОтражениеРеализацииТоваровИУслугНДС</types>
      <types>DocumentRef.ВозвратТоваровПоставщикуИзНТТ</types>
      <types>DocumentRef.АккредитивПолученный</types>
      <types>DocumentRef.РеализацияУслугПоПереработке</types>
      <types>DocumentRef.ПлатежноеПоручениеВходящее</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.КорректировкаДолга</types>
      <types>DocumentRef.ПлатежноеТребованиеПолученное</types>
      <types>DocumentRef.ПоступлениеДопРасходов</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.АккредитивПереданный</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ПоступлениеТоваровУслугВНТТ</types>
      <types>DocumentRef.КорректировкаДолгаПоВозвратнойТаре</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.ПередачаОС</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</types>
      <types>DocumentRef.ИнкассовоеПоручениеПолученное</types>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
      <types>DocumentRef.ОтчетКомиссионераОПродажах</types>
      <types>DocumentRef.ПлатежноеТребованиеВыставленное</types>
      <types>DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</types>
      <types>DocumentRef.ПлатежноеПоручениеИсходящее</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ПолучениеУслугПоПереработке</types>
      <types>DocumentRef.ИнкассовоеПоручениеПереданное</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Лео_СтатьяОборотов</name>
    <type>
      <types>CatalogRef.СтатьиОборотовПоБюджетам</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Лео_Расшифровка</name>
    <type>
      <types>CatalogRef.Лео_СтатьиОборотовРасшифровка</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

AccumulationRegisters/ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов/ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов</name>
  <comment>(Общ) Оперативное ведение расчетов с контрагентами по договорам с учетом расчетов по документам</comment>
  <resources>
    <name>СуммаВзаиморасчетов</name>
    <comment>Сумма в валюте взаиморасчетов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаРегл</name>
    <comment>Сумма в валюте регламентированного учета для договоров в у.е. </comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сделка</name>
    <type>
      <types>DocumentRef.СчетНаОплатуПоставщика</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.СчетНаОплатуПокупателю</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументРасчетовСКонтрагентом</name>
    <comment>Незакрытый документ поставки/оплаты</comment>
    <type>
      <types>DocumentRef.ОтчетКомитентуОПродажах</types>
      <types>DocumentRef.ОтражениеПоступленияТоваровИУслугНДС</types>
      <types>DocumentRef.АктОбОказанииПроизводственныхУслуг</types>
      <types>DocumentRef.ОтражениеРеализацииТоваровИУслугНДС</types>
      <types>DocumentRef.ОплатаОтПокупателяПлатежнойКартой</types>
      <types>DocumentRef.ВозвратТоваровПоставщикуИзНТТ</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
      <types>DocumentRef.АккредитивПолученный</types>
      <types>DocumentRef.РеализацияУслугПоПереработке</types>
      <types>DocumentRef.ПлатежноеПоручениеВходящее</types>
      <types>DocumentRef.ДокументРасчетовСКонтрагентом</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.КорректировкаДолга</types>
      <types>DocumentRef.ПлатежноеТребованиеПолученное</types>
      <types>DocumentRef.ПоступлениеДопРасходов</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.АккредитивПереданный</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ПоступлениеТоваровУслугВНТТ</types>
      <types>DocumentRef.КорректировкаДолгаПоВозвратнойТаре</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.ПоступлениеНМА</types>
      <types>DocumentRef.ПередачаОС</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</types>
      <types>DocumentRef.ИнкассовоеПоручениеПолученное</types>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
      <types>DocumentRef.ОтчетКомиссионераОПродажах</types>
      <types>DocumentRef.ПлатежноеТребованиеВыставленное</types>
      <types>DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</types>
      <types>DocumentRef.ПлатежноеПоручениеИсходящее</types>
      <types>DocumentRef.ПередачаНМА</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ПолучениеУслугПоПереработке</types>
      <types>DocumentRef.ИнкассовоеПоручениеПереданное</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРасчетовСКонтрагентом</name>
    <comment>Вид расчетов (по приобретению, по реализации, прочее)</comment>
    <type>
      <types>EnumRef.ВидыРасчетовСКонтрагентами</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УпрУчет</name>
    <comment>Отражается ли документ расчетов с контрагентами в управленческом учете</comment>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Reports/Лео_ПлатежныйКалендарь/ObjectModule.bsl
Процедура СформироватьОтчет(ДокументРезультат)  Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря КАК Дата
		|ПОМЕСТИТЬ ВТ_Даты
		|ИЗ
		|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
		|ГДЕ
		|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ &НачалоПериода И &КонецПериода
		|	И РегламентированныйПроизводственныйКалендарь.Пятидневка > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаявкиНаРасходованиеСредствОбороты.ЗаявкаНаРасходование,
		|	ЗаявкиНаРасходованиеСредствОбороты.Период,
		|	ЗаявкиНаРасходованиеСредствОбороты.СуммаПриход,
		|	ЗаявкиНаРасходованиеСредствОбороты.Организация.Префикс КАК ЮЛ,
		|	ЗаявкиНаРасходованиеСредствОбороты.Контрагент.НаименованиеПолное КАК НаименованиеКонтрагента,
		|	ЗаявкиНаРасходованиеСредствОбороты.ДоговорКонтрагента.ДопустимоеЧислоДнейЗадолженности КАК Отсрочка,
		|	ЗаявкиНаРасходованиеСредствОбороты.ЗаявкаНаРасходование.Лео_ДатаПоступленияТовараАкта КАК ДатаПоставки,
		|	ЗаявкиНаРасходованиеСредствОбороты.ЗаявкаНаРасходование.Лео_НормативнаяДатаОплаты КАК НДО,
		|	ЗаявкиНаРасходованиеСредствОбороты.ЗаявкаНаРасходование.Комментарий КАК НаличиеВБюджете,
		|	ВЫРАЗИТЬ(ЗаявкаНаРасходованиеСредствРасшифровкаПлатежа.Ссылка.Описание КАК СТРОКА(500)) КАК НазначениеПлатежа,
		|	ЗаявкиНаРасходованиеСредствОбороты.ЗаявкаНаРасходование.абс_СКредитногоСчета КАК СКредитногоСчета,
		|	ЗаявкиНаРасходованиеСредствОбороты.ЗаявкаНаРасходование.ДатаРасхода,
		|	ЗаявкиНаРасходованиеСредствОбороты.СтатьяДвиженияДенежныхСредств,
		|	ЗаявкиНаРасходованиеСредствОбороты.Лео_СтатьяОборотов
		|ПОМЕСТИТЬ ВТ_Заявки
		|ИЗ
		|	РегистрНакопления.ЛЕО_ЗаявкиНаРасходованиеСредств.Обороты(, , День, ЗаявкаНаРасходование.ФормаОплаты В (ЗНАЧЕНИЕ(Перечисление.ВидыДенежныхсредств.Наличные), ЗНАЧЕНИЕ(Перечисление.ВидыДенежныхсредств.Безналичные))) КАК ЗаявкиНаРасходованиеСредствОбороты
		|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаРасходованиеСредств.РасшифровкаПлатежа КАК ЗаявкаНаРасходованиеСредствРасшифровкаПлатежа
		|		ПО ЗаявкиНаРасходованиеСредствОбороты.ЗаявкаНаРасходование = ЗаявкаНаРасходованиеСредствРасшифровкаПлатежа.Ссылка
		|			И ЗаявкиНаРасходованиеСредствОбороты.ДоговорКонтрагента = ЗаявкаНаРасходованиеСредствРасшифровкаПлатежа.ДоговорКонтрагента
		|			И ЗаявкиНаРасходованиеСредствОбороты.Сделка = ЗаявкаНаРасходованиеСредствРасшифровкаПлатежа.Сделка
		|			И ЗаявкиНаРасходованиеСредствОбороты.СтатьяДвиженияДенежныхСредств = ЗаявкаНаРасходованиеСредствРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств
		|			И ЗаявкиНаРасходованиеСредствОбороты.Проект = ЗаявкаНаРасходованиеСредствРасшифровкаПлатежа.Проект
		|			И ЗаявкиНаРасходованиеСредствОбороты.ДокументРасчетовСКонтрагентом = ЗаявкаНаРасходованиеСредствРасшифровкаПлатежа.ДокументРасчетовСКонтрагентом
		|			И ЗаявкиНаРасходованиеСредствОбороты.СуммаПриход = ЗаявкаНаРасходованиеСредствРасшифровкаПлатежа.СуммаПлатежа
		|			И ЗаявкиНаРасходованиеСредствОбороты.Период = ЗаявкаНаРасходованиеСредствРасшифровкаПлатежа.абс_ДатаРасхода
		|			И ЗаявкиНаРасходованиеСредствОбороты.СтатьяДвиженияДенежныхСредств = ЗаявкаНаРасходованиеСредствРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств
		|			И ЗаявкиНаРасходованиеСредствОбороты.Лео_СтатьяОборотов = ЗаявкаНаРасходованиеСредствРасшифровкаПлатежа.Лео_СтатьяОборотов
		|ГДЕ
		|	ЗаявкиНаРасходованиеСредствОбороты.ЗаявкаНаРасходование.ДатаРасхода МЕЖДУ &НачалоПериода И &КонецПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Даты.Дата КАК Дата,
		|	ВТ_Заявки.ЗаявкаНаРасходование,
		|	ВТ_Заявки.СуммаПриход КАК Сумма,
		|	ВТ_Заявки.ЮЛ КАК ЮЛ,
		|	ВТ_Заявки.НаименованиеКонтрагента,
		|	ВТ_Заявки.Отсрочка,
		|	ВТ_Заявки.ДатаПоставки,
		|	ВТ_Заявки.НДО,
		|	ВТ_Заявки.НаличиеВБюджете,
		|	ВТ_Заявки.НазначениеПлатежа,
		|	ВТ_Заявки.СКредитногоСчета,
		|	ВЫБОР
		|		КОГДА ВТ_Заявки.СуммаПриход > 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЕстьРасчет,
		|	ВТ_Заявки.Период КАК ДатаРасходаТч,
		|	ВТ_Заявки.СтатьяДвиженияДенежныхСредств,
		|	ВТ_Заявки.Лео_СтатьяОборотов
		|ИЗ
		|	ВТ_Даты КАК ВТ_Даты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Заявки КАК ВТ_Заявки
		|		ПО ВТ_Даты.Дата = ВТ_Заявки.ЗаявкаНаРасходованиеДатаРасхода
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата,
		|	ЮЛ";

		
	Запрос.УстановитьПараметр("НачалоПериода", ДатаС);
	Запрос.УстановитьПараметр("КонецПериода", ДатаПо);

	Результат = Запрос.Выполнить();

	ТЗ_Результат = Результат.Выгрузить();
    ТЗ_Копия = ТЗ_Результат.Скопировать(,"Дата,Сумма");
	ТЗ_Копия.Свернуть("Дата","Сумма");
    ТЗ_Копия.Сортировать("Дата Возр");
	//никитин
	ТЗ_Копия.Колонки.Добавить("остатокНаНачало");
	ТЗ_Копия.Колонки.Добавить("остатокНаКонец");
    ТЗ_Копия.Колонки.Добавить("ОжидаемыПоступления");

 	
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДоговорКонтрагента,
		|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.Сделка,
		|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДокументРасчетовСКонтрагентом,
		|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.Организация,
		|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.Контрагент,
		|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.Контрагент.ОсновнойМенеджерПокупателя КАК ОсновнойМенеджер,
		|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.Контрагент.ОсновнойМенеджерПокупателя.абс_Подразделение КАК Подразделение,
		|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.Контрагент.Регион КАК Регион,
		|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток КАК ОстатокДолгаНаДату,
		|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДоговорКонтрагента.ДопустимоеЧислоДнейЗадолженности КАК ДопустимоеЧислоДнейЗадолженности,
		|	ВЫРАЗИТЬ(ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДокументРасчетовСКонтрагентом КАК Документ.РеализацияТоваровУслуг).абс_ДатаОплаты КАК ДатаОплаты
		|ПОМЕСТИТЬ ТаблицаЗадолженности
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Остатки(ДОБАВИТЬКДАТЕ(&ДатаОстатков, СЕКУНДА, -1), ) КАК ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки
		|ГДЕ
		|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаЗадолженности.Организация КАК Организация,
		|	ТаблицаЗадолженности.Контрагент КАК Контрагент,
		|	ТаблицаЗадолженности.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	СУММА(ВЫБОР
		|			КОГДА ТаблицаЗадолженности.ДатаОплаты < ДОБАВИТЬКДАТЕ(&ДатаОстатков, СЕКУНДА, -1)
		|				ТОГДА ТаблицаЗадолженности.ОстатокДолгаНаДату
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ПросроченнаяЗадолженность
		|ПОМЕСТИТЬ ТаблицаЗадолженностиИтог
		|ИЗ
		|	ТаблицаЗадолженности КАК ТаблицаЗадолженности
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаЗадолженности.Организация,
		|	ТаблицаЗадолженности.Контрагент,
		|	ТаблицаЗадолженности.ДоговорКонтрагента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаЗадолженностиПоДням.Организация КАК Организация,
		|	ТаблицаЗадолженностиПоДням.Контрагент КАК Контрагент,
		|	ТаблицаЗадолженностиПоДням.Контрагент.абс_Отдел КАК Отдел,
		|	ТаблицаЗадолженностиПоДням.Контрагент.абс_БизнесРегион КАК БизнесРегион,
		|	ТаблицаЗадолженностиПоДням.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ТаблицаЗадолженностиПоДням.ОсновнойМенеджер КАК ОсновнойМенеджер,
		|	ТаблицаЗадолженностиПоДням.Регион КАК Регион,
		|	ТаблицаЗадолженностиПоДням.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
		|	ТаблицаЗадолженностиПоДням.ДокументРасчетовСКонтрагентом КАК ДокументРасчетовСКонтрагентом,
		|	ВЫБОР
		|		КОГДА ТаблицаЗадолженностиПоДням.ДатаОплаты МЕЖДУ &ДатаОстатков И ДОБАВИТЬКДАТЕ(&ДатаОстатков, ДЕНЬ, &КоличествоДней)
		|			ТОГДА ТаблицаЗадолженностиПоДням.ДатаОплаты
		|		ИНАЧЕ &ДатаОстатков
		|	КОНЕЦ КАК ДатаОплаты,
		|	ТаблицаЗадолженностиПоДням.ДопустимоеЧислоДнейЗадолженности КАК ДопустимоеЧислоДнейЗадолженности,
		|	ВЫБОР
		|		КОГДА ТаблицаЗадолженностиПоДням.ДатаОплаты МЕЖДУ &ДатаОстатков И ДОБАВИТЬКДАТЕ(&ДатаОстатков, ДЕНЬ, &КоличествоДней)
		|			ТОГДА ТаблицаЗадолженностиПоДням.ОстатокДолгаНаДату
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ДолгиПокупателейПодлежащиеОплатеНеПозднее,
		|	ВЫБОР
		|		КОГДА ТаблицаЗадолженностиПоДням.ДатаОплаты < &ДатаОстатков
		|			ТОГДА ТаблицаЗадолженностиПоДням.ОстатокДолгаНаДату
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ПросроченнаяДебиторскаяЗадолженностьПокупателей
		|ПОМЕСТИТЬ ВТ_ПредИтог
		|{ВЫБРАТЬ
		|	Организация.*,
		|	Контрагент.*,
		|	ДоговорКонтрагента.*,
		|	ОсновнойМенеджер.*,
		|	Регион.*,
		|	ВалютаВзаиморасчетов.*,
		|	ДокументРасчетовСКонтрагентом.*,
		|	ДатаОплаты,
		|	ДопустимоеЧислоДнейЗадолженности}
		|ИЗ
		|	ТаблицаЗадолженности КАК ТаблицаЗадолженностиПоДням
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаЗадолженностиИтог КАК ТаблицаЗадолженностиИтог
		|		ПО ТаблицаЗадолженностиПоДням.Организация = ТаблицаЗадолженностиИтог.Организация
		|			И ТаблицаЗадолженностиПоДням.Контрагент = ТаблицаЗадолженностиИтог.Контрагент
		|			И ТаблицаЗадолженностиПоДням.ДоговорКонтрагента = ТаблицаЗадолженностиИтог.ДоговорКонтрагента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПредИтог.ДатаОплаты КАК ДатаОплаты,
		|	СУММА(ВТ_ПредИтог.ДолгиПокупателейПодлежащиеОплатеНеПозднее) КАК ДолгиПокупателейПодлежащиеОплатеНеПозднее
		|ИЗ
		|	ВТ_ПредИтог КАК ВТ_ПредИтог
		|ГДЕ
		|	(ВТ_ПредИтог.ПросроченнаяДебиторскаяЗадолженностьПокупателей > 0
		|			ИЛИ ВТ_ПредИтог.ДолгиПокупателейПодлежащиеОплатеНеПозднее > 0)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ПредИтог.ДатаОплаты
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаОплаты
		|{ХАРАКТЕРИСТИКИ
		|	ТИП(Справочник.Контрагенты)
		|	ВИДЫХАРАКТЕРИСТИК (ВЫБРАТЬ
		|			СвойстваОбъектов.Ссылка,
		|			СвойстваОбъектов.Наименование,
		|			СвойстваОбъектов.ТипЗначения
		|		ИЗ
		|			ПланВидовХарактеристик.СвойстваОбъектов КАК СвойстваОбъектов
		|		ГДЕ
		|			СвойстваОбъектов.НазначениеСвойства = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Контрагенты))
		|	ПОЛЕКЛЮЧА Ссылка
		|	ПОЛЕИМЕНИ Наименование
		|	ПОЛЕТИПАЗНАЧЕНИЯ ТипЗначения
		|	ЗНАЧЕНИЯХАРАКТЕРИСТИК РегистрСведений.ЗначенияСвойствОбъектов
		|	ПОЛЕОБЪЕКТА Объект
		|	ПОЛЕВИДА Свойство
		|	ПОЛЕЗНАЧЕНИЯ Значение }";

		
		
	Запрос.УстановитьПараметр("ДатаОстатков", ДатаС);
	Запрос.УстановитьПараметр("КоличествоДней",ТЗ_Копия.Колонки.Количество());
	
	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		новаястрока=ТЗ_Копия.Добавить();
		новаястрока.Дата=  ВыборкаДетальныеЗаписи.ДатаОплаты;
		новаястрока.Сумма= 0;
        новаястрока.остатокНаНачало= 0;
       	новаястрока.остатокНаКонец= 0;
       	новаястрока.ОжидаемыПоступления=  ВыборкаДетальныеЗаписи.ДолгиПокупателейПодлежащиеОплатеНеПозднее;
        
	КонецЦикла;
 ТЗ_Копия.Свернуть("Дата","Сумма,остатокНаНачало,остатокНаКонец,ОжидаемыПоступления");

		/////////////////////////////////////////////////
 Списокбанковскихсчетов= новый СписокЗначений;
 спСчета=Справочники.БанковскиеСчета;
 Списокбанковскихсчетов.Добавить(спСчета.НайтиПоКоду("000000002"));
 Списокбанковскихсчетов.Добавить(спСчета.НайтиПоКоду("00454"));
 Списокбанковскихсчетов.Добавить(спСчета.НайтиПоКоду("00007"));
 Списокбанковскихсчетов.Добавить(спСчета.НайтиПоКоду("БП002131")); 
 Списокбанковскихсчетов.Добавить(спСчета.НайтиПоКоду("00038"));
 Списокбанковскихсчетов.Добавить(спСчета.НайтиПоКоду("00254"));
    	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДенежныеСредстваОстатки.Организация КАК Организация,
		|	ДенежныеСредстваОстатки.БанковскийСчетКасса КАК БанковскийСчетКасса,
		|	ДенежныеСредстваОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ДенежныеСредства.Остатки(&НачДата, БанковскийСчетКасса В (&СписокСчетов)) КАК ДенежныеСредстваОстатки
		|ИТОГИ
		|	СУММА(СуммаОстаток)
		|ПО
		|	ОБЩИЕ,
		|	Организация,
		|	БанковскийСчетКасса";

	Запрос.УстановитьПараметр("НачДата", НачалоДня(ДатаС));
	Запрос.УстановитьПараметр("СписокСчетов", Списокбанковскихсчетов);

	Результат = Запрос.Выполнить();

	ВыборкаОбщийИтог = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
 
	ВыборкаОбщийИтог.Следующий();		// Общий итог
    ОстатокНаНачалоДня = ВыборкаОбщийИтог.СуммаОстаток;
	ОстатокНаКонецДня =0;
    Для каждого строкаТЗ Из ТЗ_Копия Цикл
		строкаТЗ.остатокНаНачало=ОстатокНаНачалоДня;
	    строкаТЗ.остатокНаКонец =строкаТЗ.остатокНаНачало-строкаТЗ.Сумма+строкаТЗ.ОжидаемыПоступления;
        ОстатокНаНачалоДня =строкаТЗ.остатокНаКонец;
		КонецЦикла;  
	 
	 
	 
	 
	 
	 //}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	//////////////////////////////////////////////////////////////////////////////
	
	ТЗ_Даты = ТЗ_Результат.Скопировать(,"Дата");
	ТЗ_Даты.Свернуть("Дата",);
    ТЗ_Даты.Сортировать("Дата Возр");

	
	Макет = ПолучитьМакет("ПлатежныйКалендарь");
	ДокументРезультат.Очистить();
	
	ЗаголовокОтчета 						= Макет.ПолучитьОбласть("ЗаголовокОтчета|ОбзастьЗначение");
	ЗаголовокОтчетаОбластьДень 				= Макет.ПолучитьОбласть("ЗаголовокОтчета|ОбластьДень");
	ЗаголовокОтчета.Параметры.НачалоПериода = Формат(ДатаС,"ДФ='d MMMM'; ДЛФ=DD");
	ЗаголовокОтчета.Параметры.КонецПериода 	= Формат(ДатаПо,"ДФ='d MMMM'; ДЛФ=DD");
	ДокументРезультат.Вывести(ЗаголовокОтчета);	
	//ТЗ_Копия = ТЗ_Результат.Скопировать(,"Дата,Сумма");
	//ТЗ_Копия.Свернуть("Дата","Сумма");
	//ТЗ_Копия.Сортировать("Дата Возр");
	Для каждого СтрокаДаты из  ТЗ_Даты Цикл
		    ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Дата",СтрокаДаты.Дата);
			НайденныеСтроки = ТЗ_Копия.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество() > 0 Тогда
				ЗаголовокОтчетаОбластьДень.Параметры.Сумма = НайденныеСтроки[0].Сумма;
				ЗаголовокОтчетаОбластьДень.Параметры.СуммаПК = НайденныеСтроки[0].Сумма;
				ЗаголовокОтчетаОбластьДень.Параметры.остатокНаНачало = НайденныеСтроки[0].остатокНаНачало;
				ЗаголовокОтчетаОбластьДень.Параметры.остатокНаКонец = НайденныеСтроки[0].остатокНаКонец;
				ЗаголовокОтчетаОбластьДень.Параметры.ОжидаемыПоступления = НайденныеСтроки[0].ОжидаемыПоступления;

			Иначе
				ЗаголовокОтчетаОбластьДень.Параметры.Сумма  = "-";
			КонецЕсли;	
			ДокументРезультат.Присоединить(ЗаголовокОтчетаОбластьДень);
	КонецЦикла;	
	
	ОбластьСтрокаЮЛЗначение					= Макет.ПолучитьОбласть("СтрокаЮЛ|ОбзастьЗначение");
	ОбластьСтрокаЮЛСтрокаЮЛ 				= Макет.ПолучитьОбласть("СтрокаЮЛ|ОбластьДень");
	ТЗ_ЮЛ = ТЗ_Результат.Скопировать(,"ЮЛ");
	ТЗ_ЮЛ.Свернуть("ЮЛ",);
    ТЗ_ЮЛ.Сортировать("ЮЛ Возр");
	//лео никитин
    ТЗ_ЮЛ.Колонки.Добавить("Позиция",,,);
	Для каждого строкаЮЛ Из ТЗ_ЮЛ Цикл
	Если строкаЮЛ.ЮЛ="LVN" Тогда
		 строкаЮЛ.Позиция=1;
	КонецЕсли; 		
	Если строкаЮЛ.ЮЛ="LTT" Тогда
		 строкаЮЛ.Позиция=2;
	КонецЕсли; 		
	Если строкаЮЛ.ЮЛ="LTR" Тогда
		 строкаЮЛ.Позиция=3;
	КонецЕсли; 		
	Если строкаЮЛ.ЮЛ="LFE" Тогда
		 строкаЮЛ.Позиция=4;
	КонецЕсли; 		
	   Если строкаЮЛ.ЮЛ="EKS" Тогда
		 строкаЮЛ.Позиция=5;
	КонецЕсли; 		
 	КонецЦикла; 
	ТЗ_ЮЛ.Сортировать("Позиция Возр");
	///
	
	Для каждого СтрокаЮЛ из  ТЗ_ЮЛ Цикл
		ОбластьСтрокаЮЛЗначение.Параметры.Юрлицо = СтрокаЮЛ.ЮЛ;
		Если НЕ СтрокаЮЛ.ЮЛ = NULL Тогда
			ДокументРезультат.Вывести(ОбластьСтрокаЮЛЗначение);
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("ЮЛ",СтрокаЮЛ.ЮЛ);
			ТЗ_СтрокиЮЛ = ТЗ_Результат.Скопировать(ПараметрыОтбора,"Дата,Сумма");
			ТЗ_СтрокиЮЛ.Свернуть("Дата","Сумма");
		    ТЗ_СтрокиЮЛ.Сортировать("Дата Возр");
			Для каждого СтрокаДаты из  ТЗ_Даты Цикл
			    ПараметрыОтбора = Новый Структура;
				ПараметрыОтбора.Вставить("Дата",СтрокаДаты.Дата);
				НайденныеСтроки = ТЗ_СтрокиЮЛ.НайтиСтроки(ПараметрыОтбора);
				Если НайденныеСтроки.Количество() > 0 Тогда
					ОбластьСтрокаЮЛСтрокаЮЛ.Параметры.Сумма = НайденныеСтроки[0].Сумма;
				Иначе
					ОбластьСтрокаЮЛСтрокаЮЛ.Параметры.Сумма = 0;
				КонецЕсли;
				ДокументРезультат.Присоединить(ОбластьСтрокаЮЛСтрокаЮЛ);
			КонецЦикла;
			
		КонецЕсли;
	КонецЦикла;
	
	ОбластьИтогПоКредитамЗначение			= Макет.ПолучитьОбласть("ИтогПоКредитам|ОбзастьЗначение");
	ОбластьИтогПоКредитамРбластьДень 		= Макет.ПолучитьОбласть("ИтогПоКредитам|ОбластьДень");
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("СКредитногоСчета",Истина);
	ТЗ_СтрокиКредит = ТЗ_Результат.Скопировать(ПараметрыОтбора,"Дата,Сумма");
	ТЗ_СтрокиКредит.Свернуть("Дата","Сумма");
	ТЗ_СтрокиКредит.Сортировать("Дата Возр");
	ДокументРезультат.Вывести(ОбластьИтогПоКредитамЗначение);	
	Для каждого СтрокаДаты из  ТЗ_Даты Цикл
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Дата",СтрокаДаты.Дата);
		НайденныеСтроки = ТЗ_СтрокиКредит.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() > 0 Тогда
			ОбластьИтогПоКредитамРбластьДень.Параметры.Сумма = НайденныеСтроки[0].Сумма;
		Иначе
			ОбластьИтогПоКредитамРбластьДень.Параметры.Сумма = 0;
		КонецЕсли;
		ДокументРезультат.Присоединить(ОбластьИтогПоКредитамРбластьДень);
	КонецЦикла;

    ОбластьШапкаОтчетаЗначение			= Макет.ПолучитьОбласть("ШапкаОтчета|ОбзастьЗначение");
	ОбластьШапкаОтчетаОбластьДень 		= Макет.ПолучитьОбласть("ШапкаОтчета|ОбластьДень");
    ДокументРезультат.Вывести(ОбластьШапкаОтчетаЗначение);	
	Для каждого СтрокаДаты из  ТЗ_Даты Цикл
    	ОбластьШапкаОтчетаОбластьДень.Параметры.Дата = Формат (СтрокаДаты.Дата, "ДФ='dd MMMM'");
		ДокументРезультат.Присоединить(ОбластьШапкаОтчетаОбластьДень);
	КонецЦикла;
	
	ОбластьСтрокаОтчетаЗначение			= Макет.ПолучитьОбласть("СтрокаОтчета|ОбзастьЗначение");
	ОбластьСтрокаОтчетаОбластьДень 		= Макет.ПолучитьОбласть("СтрокаОтчета|ОбластьДень");
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ЕстьРасчет",Истина);
	ТЗ_СтрокиЗаголовка = ТЗ_Результат.Скопировать(ПараметрыОтбора,"ЮЛ,НаименованиеКонтрагента,Отсрочка,ДатаПоставки,НДО,НаличиеВБюджете,НазначениеПлатежа,СКредитногоСчета,ДатаРасходаТч,ЗаявкаНаРасходование,СтатьяДвиженияДенежныхСредств,Лео_СтатьяОборотов");
	//лео никитин
    ТЗ_СтрокиЗаголовка.Колонки.Добавить("Позиция",,,);
	Для каждого строкаЮЛ Из ТЗ_СтрокиЗаголовка Цикл
	Если строкаЮЛ.ЮЛ="LVN" Тогда
		 строкаЮЛ.Позиция=1;
	КонецЕсли; 		
	Если строкаЮЛ.ЮЛ="LTT" Тогда
		 строкаЮЛ.Позиция=2;
	КонецЕсли; 		
	Если строкаЮЛ.ЮЛ="LTR" Тогда
		 строкаЮЛ.Позиция=3;
	КонецЕсли; 		
	Если строкаЮЛ.ЮЛ="LFE" Тогда
		 строкаЮЛ.Позиция=4;
	КонецЕсли; 		
	   Если строкаЮЛ.ЮЛ="EKS" Тогда
		 строкаЮЛ.Позиция=5;
	КонецЕсли; 		
 	КонецЦикла; 

	
	
	ТЗ_СтрокиЗаголовка.Сортировать("Позиция Возр,НаименованиеКонтрагента Возр,ДатаПоставки Возр ");
	Для Каждого СтрокаЗаголовка из ТЗ_СтрокиЗаголовка Цикл
		ОбластьСтрокаОтчетаЗначение.Параметры.Заполнить(СтрокаЗаголовка);
		ОбластьСтрокаОтчетаЗначение.Параметры.ЦФО=СтрокаЗаголовка.Лео_СтатьяОборотов.абс_КодБюджетнойСтатьи;
		ОбластьСтрокаОтчетаЗначение.Параметры.Назначениеплатежа=СтрокаЗаголовка.ЗаявкаНаРасходование.описание;
		ОбластьСтрокаОтчетаЗначение.Параметры.НДО                                      = Формат(СтрокаЗаголовка.НДО,"ДЛФ=Д");
        ОбластьСтрокаОтчетаЗначение.Параметры.ДатаПоставки    = Формат(СтрокаЗаголовка.ДатаПоставки,"ДЛФ=Д");

		ДокументРезультат.Вывести(ОбластьСтрокаОтчетаЗначение);
				Для каждого СтрокаДаты из  ТЗ_Даты Цикл
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Дата",СтрокаДаты.Дата);
			ПараметрыОтбора.Вставить("ЮЛ",СтрокаЗаголовка.ЮЛ);
			ПараметрыОтбора.Вставить("НаименованиеКонтрагента",СтрокаЗаголовка.НаименованиеКонтрагента);
			ПараметрыОтбора.Вставить("Отсрочка",СтрокаЗаголовка.Отсрочка);
			ПараметрыОтбора.Вставить("ДатаПоставки",СтрокаЗаголовка.ДатаПоставки);
			ПараметрыОтбора.Вставить("НДО",СтрокаЗаголовка.НДО);
			//ПараметрыОтбора.Вставить("ЦФО",СтрокаЗаголовка.НДО);
			
			ПараметрыОтбора.Вставить("НаличиеВБюджете",СтрокаЗаголовка.НаличиеВБюджете);
			ПараметрыОтбора.Вставить("НазначениеПлатежа",СтрокаЗаголовка.НазначениеПлатежа);
			ПараметрыОтбора.Вставить("СКредитногоСчета",СтрокаЗаголовка.СКредитногоСчета);
			ПараметрыОтбора.Вставить("ДатаРасходаТч",СтрокаЗаголовка.ДатаРасходаТч);
			ПараметрыОтбора.Вставить("ЗаявкаНаРасходование",СтрокаЗаголовка.ЗаявкаНаРасходование);
			ПараметрыОтбора.Вставить("СтатьяДвиженияДенежныхСредств",СтрокаЗаголовка.СтатьяДвиженияДенежныхСредств);
			ПараметрыОтбора.Вставить("Лео_СтатьяОборотов",СтрокаЗаголовка.Лео_СтатьяОборотов);

			//	сообщить(СтрокаЗаголовка.СтатьяДвиженияДенежныхСредств);     
		//	сообщить(СтрокаЗаголовка.ЗаявкаНаРасходование);
			НайденныеСтроки = ТЗ_Результат.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество() > 0 Тогда
				ОбластьСтрокаОтчетаОбластьДень.Параметры.Сумма = НайденныеСтроки[0].Сумма;
			Иначе
				ОбластьСтрокаОтчетаОбластьДень.Параметры.Сумма = 0;
			КонецЕсли;
			ДокументРезультат.Присоединить(ОбластьСтрокаОтчетаОбластьДень);
		КонецЦикла;
	КонецЦикла;
	ДокументРезультат.ОриентацияСтраницы=ОриентацияСтраницы.Ландшафт;
	ДокументРезультат.Автомасштаб=Истина;

КонецПроцедуры
